In [1]:
import numpy as np
import pandas as pd
import os

In [2]:
pd_temp = pd.read_csv('./911call/other/chifoia_es_01012018.csv',skiprows=0,header=0)

D:\ProgramData\Anaconda3\envs\FinalProject\lib\site-packages\IPython\core\interactiveshell.py:2728: DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
pd_temp.head()

,EVENTNUMBER,UNIT,UNAOCCCNT,OCCCNT,STATUSNAME,CREATIONDATE,OVERRIDEDATE,STACKEDFLAG
0,1800100003,1723R,1,1,DIS,01/01/2018 00.00.38,NaN,NaN
1,1800100003,1723R,1,2,ACK,01/01/2018 00.02.15,NaN,NaN
2,1800100003,1723R,1,3,ENR,01/01/2018 00.02.34,NaN,NaN
3,1800100003,1723R,1,4,ONS,NaN,NaN,NaN
4,1800100003,1723R,1,5,AV,01/01/2018 00.48.09,NaN,NaN

In [4]:
pd_temp.columns

Index(['EVENTNUMBER', 'UNIT', 'UNAOCCCNT', 'OCCCNT', 'STATUSNAME',
       'CREATIONDATE', 'OVERRIDEDATE', 'STACKEDFLAG'],
      dtype='object')

In [5]:
pd_temp.head()

,EVENTNUMBER,UNIT,UNAOCCCNT,OCCCNT,STATUSNAME,CREATIONDATE,OVERRIDEDATE,STACKEDFLAG
0,1800100003,1723R,1,1,DIS,01/01/2018 00.00.38,NaN,NaN
1,1800100003,1723R,1,2,ACK,01/01/2018 00.02.15,NaN,NaN
2,1800100003,1723R,1,3,ENR,01/01/2018 00.02.34,NaN,NaN
3,1800100003,1723R,1,4,ONS,NaN,NaN,NaN
4,1800100003,1723R,1,5,AV,01/01/2018 00.48.09,NaN,NaN

In [6]:
pdf = pd.DataFrame()

In [7]:
path = './911call/chifoia_event_unit/other/'
files= os.listdir(path)
files

['chifoia_eu_01012018.csv',
 'chifoia_eu_02012018.csv',
 'chifoia_eu_03012018.csv',
 'chifoia_eu_04012018.csv',
 'chifoia_eu_09012017.csv',
 'chifoia_eu_10012017.csv',
 'chifoia_eu_11012017.csv',
 'chifoia_eu_12012017.csv']

In [8]:
for file in files:
    pd_temp = pd.read_csv(path+file,skiprows=1,header=None)
    pd_temp.columns = ['EVENTNUMBER', 'UNIT', 'UNAOCCCNT', 'OCCCNT', 'STATUSNAME',
       'CREATIONDATE', 'OVERRIDEDATE', 'STACKEDFLAG']
    print(pd_temp.shape)
    pdf = pd.concat([pdf,pd_temp])
    print(pdf.shape)

D:\ProgramData\Anaconda3\envs\FinalProject\lib\site-packages\IPython\core\interactiveshell.py:2728: DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

(578529, 8)
(578529, 8)
(532036, 8)
(1110565, 8)
(633572, 8)
(1744137, 8)
(627118, 8)
(2371255, 8)
(646180, 8)
(3017435, 8)
(628155, 8)
(3645590, 8)
(585540, 8)
(4231130, 8)
(600257, 8)
(4831387, 8)

In [9]:
pdf.head()

,EVENTNUMBER,UNIT,UNAOCCCNT,OCCCNT,STATUSNAME,CREATIONDATE,OVERRIDEDATE,STACKEDFLAG
0,1800100003,1723R,1,1,DIS,01/01/2018 00.00.38,NaN,NaN
1,1800100003,1723R,1,2,ACK,01/01/2018 00.02.15,NaN,NaN
2,1800100003,1723R,1,3,ENR,01/01/2018 00.02.34,NaN,NaN
3,1800100003,1723R,1,4,ONS,NaN,NaN,NaN
4,1800100003,1723R,1,5,AV,01/01/2018 00.48.09,NaN,NaN

In [10]:
pdf.CREATIONDATE = pd.to_datetime(pdf.CREATIONDATE, format='%m/%d/%Y %H.%M.%S',errors='coerce')

In [11]:
pdf.OVERRIDEDATE = pd.to_datetime(pdf.OVERRIDEDATE, format='%m/%d/%Y %H.%M.%S',errors='coerce')

In [12]:
pdf.to_csv('./911call/chifoia_event_unit_other.csv')

In [13]:
pdf.head()

,EVENTNUMBER,UNIT,UNAOCCCNT,OCCCNT,STATUSNAME,CREATIONDATE,OVERRIDEDATE,STACKEDFLAG
0,1800100003,1723R,1,1,DIS,2018-01-01 00:00:38,NaT,NaN
1,1800100003,1723R,1,2,ACK,2018-01-01 00:02:15,NaT,NaN
2,1800100003,1723R,1,3,ENR,2018-01-01 00:02:34,NaT,NaN
3,1800100003,1723R,1,4,ONS,NaT,NaT,NaN
4,1800100003,1723R,1,5,AV,2018-01-01 00:48:09,NaT,NaN